## Plan Result (sbox_shutter_webapp)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;plumclassic&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;plumclassic&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;plumclassic&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;plumclassic&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;plumclassic&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["plumclassic"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "frontdoor-sandbox-platform-hmcts-net-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "frontdoor.sandbox.platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["plumclassic"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.frontdoor-sandbox-platform-hmcts-net"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "frontdoor.sandbox.platform.hmcts.net"

      + record {
          + value = (known after apply)
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["plumclassic"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "plumclassic"
      + resource_group_name = "cft-platform-shutter-webapp-sbox-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["plumclassic"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "frontdoor-sandbox-platform-hmcts-net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["plumclassic"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "plumclassic_sbox"
      + updated_at      = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1772,"Program":"tfcmt","SHA1":"","Target":"sbox_shutter_webapp","Vars":{}} -->